EDT/УТ/src/DataProcessors/РаботаСПрикрепленнымиФайлами/РаботаСПрикрепленнымиФайлами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСПрикрепленнымиФайлами</name>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/ПрикрепленныеФайлы/ПрикрепленныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрикрепленныеФайлы</name>
  <attributes>
    <name>ИДЗависимостиВБДДокументов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Данные</name>
    <type>
      <types>CatalogRef.ПрикрепленныеФайлы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторВнешнихДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СостоянияПрикрепленныхФайлов/СостоянияПрикрепленныхФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияПрикрепленныхФайлов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеФайла</name>
    <type>
      <types>EnumRef.СостоянияПрикрепленныхФайлов</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторФайлаНаСервереАдминки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПрикрепленныйФайл</name>
    <type>
      <types>CatalogRef.ПрикрепленныеФайлы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторВнешнихДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СостоянияПрикрепленныхФайлов/СостоянияПрикрепленныхФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПрикрепленныхФайлов</name>
  <enumValues>
    <name>ФайлДобавлен</name>
  </enumValues>
  <enumValues>
    <name>ФайлВыгруженНаСерверДокументов</name>
  </enumValues>
  <enumValues>
    <name>ФайлУдален</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/DataProcessors/РаботаСПрикрепленнымиФайлами/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") Тогда
		Документ = Параметры.Документ;
		ЗаполнитьПоДокументу_Новая();
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументу()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрикрепленныеФайлы.Данные КАК Файл
		|ПОМЕСТИТЬ ВТ_ПрикрепленныеФайлы
		|ИЗ
		|	РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
		|ГДЕ
		|	ПрикрепленныеФайлы.Документ = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПрикрепленныеФайлы.Файл КАК ПрикрепленныйФайл,
		|	ЕСТЬNULL(СостоянияПрикрепленныхФайловСрезПоследних.СостояниеФайла, Значение(Перечисление.СостоянияПрикрепленныхФайлов.ФайлДобавлен)) КАК Состояние
		|ИЗ
		|	ВТ_ПрикрепленныеФайлы КАК ВТ_ПрикрепленныеФайлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПрикрепленныхФайлов.СрезПоследних(
		|				,
		|				ПрикрепленныйФайл В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ПрикрепленныеФайлы.Файл КАК Файл
		|					ИЗ
		|						ВТ_ПрикрепленныеФайлы КАК ВТ_ПрикрепленныеФайлы)) КАК СостоянияПрикрепленныхФайловСрезПоследних
		|		ПО ВТ_ПрикрепленныеФайлы.Файл = СостоянияПрикрепленныхФайловСрезПоследних.ПрикрепленныйФайл";
	
	Запрос.УстановитьПараметр("ДокументСсылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();	

	ТаблицаФайлов.Загрузить(РезультатЗапроса.Выгрузить());
		
КонецПроцедуры // ()

//CeHbKA 05.08.2020
&НаСервере
Процедура ЗаполнитьПоДокументу_Новая()

	ТаблицаФайлов.Очистить();
	
	СоответствиеВнешнихИдентификаторов = Новый СписокЗначений;
	//СписокФайлов = РаботаСПрикрепленнымиФайламиСервер.ПолучитьСписокЗначенийПрикрепленныеФайлы(Документ, СоответствиеВнешнихИдентификаторов);		
	
	//CeHbKA 12.02.2021
	АдресВХ = РаботаСПрикрепленнымиФайламиСервер.ПолучитьСписокЗначенийПрикрепленныеФайлы(Документ, СоответствиеВнешнихИдентификаторов);		
	СписокФайлов = ПолучитьИзВременногоХранилища(АдресВХ);
	//CeHbKA 12.02.2021
	
	Для Индекс = 0 по СписокФайлов.Количество()-1 цикл
		СтрокаСЗ = СписокФайлов[Индекс];
		СтрокаСоответствия = СоответствиеВнешнихИдентификаторов[Индекс];
		
		НоваяСтрока = ТаблицаФайлов.Добавить();
		
		Если ТипЗнч(СтрокаСоответствия.Значение) = Тип("СправочникСсылка.ПрикрепленныеФайлы") Тогда
			НоваяСтрока.ПрикрепленныйФайл = СтрокаСоответствия.Значение;
		Иначе
			НоваяСтрока.ИдентификаторВнешнихДанных = СтрокаСоответствия.Значение;
		КонецЕсли;
		
		НоваяСтрока.Наименование = СтрокаСЗ.Представление;
		
	КонецЦикла;
	
КонецПроцедуры // ()
//CeHbKA 05.08.2020


&НаКлиенте
Процедура УдалитьФайл(Команда)
	
	ТекСтрока = Элементы.ТаблицаФайлов.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Документ) Тогда
		РаботаСПрикрепленнымиФайламиСервер.ДобавитьЗаписьВРегистрСостоянияПрикрепленныхФайлов(ТекСтрока.ПрикрепленныйФайл, ПредопределенноеЗначение("Перечисление.СостоянияПрикрепленныхФайлов.ФайлУдален"), ТекСтрока.ИдентификаторВнешнихДанных);
		ЗаполнитьПоДокументу_Новая();	
	КонецЕсли; 	
	
	Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		Попытка
			ВладелецФормы.ОбновитьСписокВозвратов = Истина;	
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры
